src/InformationRegisters/ПРО_ПереопределяемыеПравилаРегистрацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПРО_ПереопределяемыеПравилаРегистрацииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияОбъектаРазрешена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПОД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименитьСобственноеПравило</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсполняемыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_УзелПланаОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРегистрации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_ИдентификаторОбъектаМетаданных</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПРО_НастройкиУзловРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПРО_НастройкиУзловРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьПереопределениеРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_УзелПланаОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ПРО_УправлениеПравиламиРегистрации/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// MIT License  Copyright (c) 2025 Mikhail Nastaskov
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет фильтрацию получателей данных после применения правил регистрации объектов (ПРО)
// Для работы необходимо заимствовать типовую процедуру из общего модуля ОбменДаннымиСобытия
// 
//  &После("ВыполнитьПравилаРегистрацииОбъектовДляПланаОбменаПопыткаИсключение")
//  Процедура ПРО_ВыполнитьПравилаРегистрацииОбъектовДляПланаОбменаПопыткаИсключение(МассивУзловРезультат, 
//           Объект, ИмяПланаОбмена, ДополнительныеПараметры)
//
//      ПРО_УправлениеПравиламиРегистрации.ВыполнитьПереопределяемыеПравилаРегистрацииДляПланаОбменаПослеПРО(
//           Объект, МассивУзловРезультат, ИмяПланаОбмена, ДополнительныеПараметры);
//   
//  КонецПроцедуры 
// 
// Параметры:
//   ИсточникДанных - Произвольный - Источник данных, для которого выполняется фильтрация
//   Получатели     - Массив из ПланОбменаСсылка - Массив узлов плана обмена для фильтрации
//   ИмяПланаОбмена - Строка       - Имя плана обмена, к которому применяется фильтрация
// 
//  ДополнительныеПараметры - Структура - уточняющие сведения об изменяемых данных:
//    * ОбъектМетаданных - ОбъектМетаданных - объект метаданных, которому соответствуют изменяемые данные. Обязательный.
//    * ЭтоРегистр - Булево - значение Истина означает, что обрабатывается регистр.
//        Необязательный, значение по умолчанию Ложь.
//    * ЭтоУдалениеОбъекта - Булево - значение Истина означает, что обрабатывается удаление объекта.
//        Необязательный, значение по умолчанию Ложь.
//    * РежимЗаписи - РежимЗаписиДокумента - режим записи документа (только для документов).
//        Необязательный, значение по умолчанию Неопределено.
//    * Замещение - Булево - режим записи регистра (только для регистров).
//        Необязательный, значение по умолчанию Неопределено.
//    * ПроверятьСсылку - Булево - признак необходимости учитывать версию данных на момент до их изменения.
//        Необязательный, значение по умолчанию Ложь.
//    * Выгрузка - Булево - параметр определяет контекст выполнения правила регистрации.
//        Истина - правило регистрации выполняется в контексте выгрузки объекта.
//        Ложь - правило регистрации выполняется в контексте перед записью объекта.
//        Необязательный, значение по умолчанию Ложь.
//
Процедура ВыполнитьПереопределяемыеПравилаРегистрацииДляПланаОбменаПослеПРО(ИсточникДанных,
	Получатели, ИмяПланаОбмена, ДополнительныеПараметры) Экспорт
	
	ТипУзла = ТипЗнч(ПланыОбмена[ИмяПланаОбмена].ПустаяСсылка());
	Если Не Метаданные.ОпределяемыеТипы.ПРО_УзелПланаОбмена.Тип.СодержитТип(ТипУзла) Тогда
		Возврат;
	КонецЕсли;
	
	КэшДанных          = ПРО_УправлениеПравиламиРегистрацииПовтИсп.КэшДанныхПереопределяемыхПравил();
	УзлыПланаОбмена    = КэшДанных.УзлыПланаОбмена.НайтиСтроки(Новый Структура("ИмяПланаОбмена", ИмяПланаОбмена));
	ПравилаРегистрации = КэшДанных.ПравилаРегистрации;
	ПолноеИмяИсточника = ОбщегоНазначения.ИмяТаблицыПоСсылке(ИсточникДанных);
	
	Исключаемые = Новый Массив;
	
	Для Каждого УзелДанные Из УзлыПланаОбмена Цикл
		ОбработатьУзелПланаОбменаПослеПРО(
			ИсточникДанных, УзелДанные, ПолноеИмяИсточника,
			ПравилаРегистрации, Получатели, Исключаемые, ДополнительныеПараметры);
	КонецЦикла;
	
	Если Исключаемые.Количество() > 0 Тогда
		Получатели = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Получатели, Исключаемые);
	КонецЕсли;
	
КонецПроцедуры

#Область НастройкиУзловИПравилРегистрации

// Заполняет правила обработки данных для плана обмена на основании правил обработки данных
// из менеджера обмена через универсальный формат, а так же объекты из состава плана обмена.
//
// Параметры:
//   УзелПланОбмена - ОпределяемыйТип.ПРО_УзелПланаОбмена - узел плана обмена, для которого заполняются правила.
//
Процедура ЗаполнитьПравилаРегистрацииОбъектов(УзелПланОбмена) Экспорт
	
	ПравилаОбработкиДанных = ПравилаОбработкиДанныхПоМенеджеруОбмена(УзелПланОбмена);
	
	ПолныеИменаМетаданных = Новый Массив;
	Для Каждого ПравилоОбработки Из ПравилаОбработкиДанных Цикл
		ПолныеИменаМетаданных.Добавить(ПравилоОбработки.ОбъектВыборкиМетаданные.ПолноеИмя());
	КонецЦикла;
	ИдентификаторыОбъектовРегистрации = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(ПолныеИменаМетаданных);
	
	АктуальныеИдентификаторыПОД      = ИзвлечьИдентификаторыПОД(ИдентификаторыОбъектовРегистрации);
	ИдентификаторыТолькоПланаОбмена  = ИзвлечьИдентификаторыСоставаПланаОбмена(УзелПланОбмена, АктуальныеИдентификаторыПОД);
	
	РегистрыСведений.ПРО_ПереопределяемыеПравилаРегистрацииОбъектов.АктуализироватьПравилаРегистрации(
		УзелПланОбмена, АктуальныеИдентификаторыПОД, ИдентификаторыТолькоПланаОбмена);
	
	ПРО_УправлениеПравиламиРегистрацииСлужебный.СброситьКэшПравилРегистрации();
	
КонецПроцедуры

// Обновляет настройки для указанного узла плана обмена и сбрасывает кэш правил регистрации.
//
// Параметры:
//   УзелПланаОбмена - ОпределяемыйТип.ПРО_УзелПланаОбмена - узел плана обмена, для которого обновляются настройки.
//   Настройки - ТаблицаЗначений - таблица настроек для обновления
//
Процедура ОбновитьНастройкиУзлаРегистрации(УзелПланаОбмена, Настройки) Экспорт
	
	МенеджерНастроек = РегистрыСведений.ПРО_НастройкиУзловРегистрации;
	МенеджерНастроек.ПереопределитьНастройкиУзла(УзелПланаОбмена, Настройки);
	
	ПРО_УправлениеПравиламиРегистрацииСлужебный.СброситьКэшПравилРегистрации();
	
КонецПроцедуры

// Возвращает структуру настроек узла с значениями по умолчанию.
// Используется как конструктор перед вызовом ОбновитьНастройкиУзлаРегистрации.
//
// Возвращаемое значение:
//   Структура:
//     * ИспользоватьПереопределениеРегистрации - Булево - Ложь
//
Функция НовыеНастройкиУзла() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("ИспользоватьПереопределениеРегистрации", Ложь);
	Возврат Настройки;
	
КонецФункции

// Возвращает настройки узла плана обмена.
// Единая точка чтения: симметрична ОбновитьНастройкиУзлаРегистрации.
//
// Параметры:
//   УзелПланаОбмена - ОпределяемыйТип.ПРО_УзелПланаОбмена
//
// Возвращаемое значение:
//   Структура - См. НовыеНастройкиУзла
//
Функция ПолучитьНастройкиУзлаРегистрации(УзелПланаОбмена) Экспорт

	Возврат РегистрыСведений.ПРО_НастройкиУзловРегистрации.ПолучитьНастройки(УзелПланаОбмена);

КонецФункции

// Изменяет отметку о разрешении или запрете регистрации объектов по ключам записей
//
// Параметры:
//  КлючиЗаписей - Массив из Структура - массив структур с ключами для поиска записей:
//    * УзелИнформационнойБазы - ОпределяемыйТип.ПРО_УзелПланаОбмена
//    * ОбъектРегистрации - СправочникСсылка.ИдентификаторыОбъектовМетаданных, 
//                          СправочникСсылка.ИдентификаторыОбъектовРасширений
//  ЗначениеОтметки - Булево - значение отметки (Истина - разрешить, Ложь - запретить)
//
Процедура ОбновитьРазрешенияРегистрацииПоКлючам(КлючиЗаписей, ЗначениеОтметки) Экспорт
	
	МенеджерОбъекта = РегистрыСведений.ПРО_ПереопределяемыеПравилаРегистрацииОбъектов;
	
	Отметки = Новый Массив;
	
	Для каждого КлючЗаписи Из КлючиЗаписей Цикл
		
		МенеджерЗаписи = МенеджерОбъекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УзелИнформационнойБазы = КлючЗаписи.УзелИнформационнойБазы;
		МенеджерЗаписи.ОбъектРегистрации = КлючЗаписи.ОбъектРегистрации;
		МенеджерЗаписи.Прочитать();
		
		ПараметрыЗаписи = МенеджерОбъекта.НовыйПараметрыПереопределяемогоПравила();
		ЗаполнитьЗначенияСвойств(ПараметрыЗаписи, МенеджерЗаписи);
		ПараметрыЗаписи.Вставить("РегистрацияОбъектаРазрешена", ЗначениеОтметки);
		
		Отметки.Добавить(ПараметрыЗаписи);
	КонецЦикла;
	
	Для Каждого Настройка Из Отметки Цикл
		МенеджерОбъекта.ИзменитьНастройкуПравила(Настройка);
	КонецЦикла;
	
	ПРО_УправлениеПравиламиРегистрацииСлужебный.СброситьКэшПравилРегистрации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодписокНаСобытия

// Событие перед записью узла плана обмена.
// 
// Параметры:
//  Источник - ПланОбменаОбъект - узел плана обмена
//  Отказ - Булево - Отказ
//
Процедура ПередЗаписьюУзлаПланаОбмена(Источник, Отказ) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый", Источник.ЭтоНовый());
	
КонецПроцедуры

// Событие при записи узла плана обмена.
// 
// Параметры:
//  Источник - ПланОбменаОбъект - узел плана обмена
//  Отказ - Булево - Отказ
//
Процедура ПриЗаписиУзлаПланаОбмена(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.ЭтоНовый Тогда
		
		Настройки = НовыеНастройкиУзла();
		Настройки.ИспользоватьПереопределениеРегистрации = Ложь;
		
		МенеджерНастроек = РегистрыСведений.ПРО_НастройкиУзловРегистрации;
		МенеджерНастроек.ПереопределитьНастройкиУзла(Источник.Ссылка, Настройки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаССоставомПланаОбмена

// Извлекает массив ссылок-идентификаторов объектов из переданного соответствия ПОД.
//
// Параметры:
//    ИдентификаторыОбъектовРегистрации - Соответствие из КлючИЗначение:
//        * Ключ     - Строка - полное имя объекта метаданных или расширения
//        * Значение - ОпределяемыйТип.ПРО_ИдентификаторОбъектаМетаданных
//
// Возвращаемое значение:
//    Массив из СправочникСсылка.ИдентификаторыОбъектовМетаданных,
//             СправочникСсылка.ИдентификаторыОбъектовРасширений
//
Функция ИзвлечьИдентификаторыПОД(ИдентификаторыОбъектовРегистрации)

	Результат = Новый Массив;
	Для Каждого Элемент Из ИдентификаторыОбъектовРегистрации Цикл
		Результат.Добавить(Элемент.Значение);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает идентификаторы объектов из состава плана обмена, не входящие в список ПОД.
//
// Параметры:
//    Узел                        - ОпределяемыйТип.ПРО_УзелПланаОбмена
//    АктуальныеИдентификаторыПОД - Массив из ОпределяемыйТип.ПРО_ИдентификаторОбъектаМетаданных
//
// Возвращаемое значение:
//    Массив из ОпределяемыйТип.ПРО_ИдентификаторОбъектаМетаданных
//
Функция ИзвлечьИдентификаторыСоставаПланаОбмена(Узел, АктуальныеИдентификаторыПОД)

	ВсеИдентификаторыПланаОбмена = ИдентификаторыМетаданныхИзСоставаПланаОбмена(Узел);

	Возврат ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ВсеИдентификаторыПланаОбмена,
		АктуальныеИдентификаторыПОД);

КонецФункции

// Возвращает список идентификаторов объектов метадаынных из состава указанного плана обмена.
// Состав плана обмена - объект метаданных конфигурации, не таблица БД; итерация через Метаданные.
//
// Параметры:
//  Узел - ОпределяемыйТип.ПРО_УзелПланаОбмена - узел плана обмена
//
// Возвращаемое значение:
//  Массив из ОпределяемыйТип.ПРО_ИдентификаторОбъектаМетаданных
//
Функция ИдентификаторыМетаданныхИзСоставаПланаОбмена(Узел)

	//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
	ИмяПланаОбмена = Узел.Метаданные().Имя;
	ПланОбмена     = Метаданные.ПланыОбмена[ИмяПланаОбмена];

	ПолныеИменаМетаданных = Новый Массив;
	Для Каждого Элемент Из ПланОбмена.Состав Цикл
		ПолныеИменаМетаданных.Добавить(Элемент.Метаданные.ПолноеИмя());
	КонецЦикла;

	ИдентификаторыМетаданных = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(ПолныеИменаМетаданных);

	ЗначенияИдентификаторов = Новый Массив;
	Для Каждого Идентификатор Из ИдентификаторыМетаданных Цикл
		ЗначенияИдентификаторов.Добавить(Идентификатор.Значение);
	КонецЦикла;

	Возврат ЗначенияИдентификаторов;

КонецФункции

#КонецОбласти

#Область ИсполняемыеПравилаРегистрации

// Обрабатывает один узел плана обмена: определяет, нужно ли исключить узел из получателей
// или выполнить исполняемое правило регистрации.
//
// Параметры:
//  ИсточникДанных          - Произвольный
//  УзелДанные              - СтрокаТаблицыЗначений - строка кэша узлов плана обмена
//  ПолноеИмяИсточника      - Строка
//  ПравилаРегистрации      - ТаблицаЗначений
//  Получатели              - Массив из ПланОбменаСсылка
//  Исключаемые             - Массив из ПланОбменаСсылка
//  ДополнительныеПараметры - Структура - см. ВыполнитьПереопределяемыеПравилаРегистрацииДляПланаОбменаПослеПРО
//
Процедура ОбработатьУзелПланаОбменаПослеПРО(ИсточникДанных, УзелДанные, ПолноеИмяИсточника,
	ПравилаРегистрации, Получатели, Исключаемые, ДополнительныеПараметры)
	
	Узел                        = УзелДанные.УзелПланаОбмена;
	ИспользоватьПереопределение = УзелДанные.ИспользоватьПереопределение;
	
	ОтборПравил            = Новый Структура("УзелПланаОбмена,ПолноеИмяОбъекта", Узел, ПолноеИмяИсточника);
	ПравилоРегистрацииОбъекта = ПравилаРегистрации.НайтиСтроки(ОтборПравил);
	
	Если ПравилоРегистрацииОбъекта.Количество() = 0 Тогда
		// Правило для данного объекта не задано.
		// Переопределение включено, но объект явно не разрешён - исключаем.
		Если ИспользоватьПереопределение Тогда
			Исключаемые.Добавить(Узел);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтрокаПравила = ПравилоРегистрацииОбъекта[0];
	
	// Если переопределение включено и объект явно запрещён - исключаем, не выполняя исполняемый код.
	Если ИспользоватьПереопределение И Не СтрокаПравила.РегистрацияОбъектаРазрешена Тогда
		Исключаемые.Добавить(Узел);
		Возврат;
	КонецЕсли;
	
	// Объект разрешён (явно или потому что переопределение отключено) - выполняем исполняемое правило.
	ВыполнитьПравилоРегистрацийОбъектаДляУзлаПланаОбменаПослеПРО(
		ИсточникДанных, Узел, СтрокаПравила, Получатели, Исключаемые, ДополнительныеПараметры);
	
КонецПроцедуры

// Выполняет регистрацию получателей по условию после типовых ПРО.
// Обрабатывает сначала текущее состояние объекта, затем при необходимости - ссылку (до изменения).
//
// Параметры:
//  ДанныеИБ                 - Произвольный - изменяемые данные ИБ.
//  Узел                     - ПланОбменаСсылка - узел, для которого проверяется правило.
//  СтрокаПравила            - СтрокаТаблицыЗначений - строка кэша с полями:
//    * ПрименитьСобственноеПравило - Булево
//    * ИсполняемыйКод              - Строка
//  УзлыПолучатели           - Массив из ПланОбменаСсылка - коллекция узлов-получателей.
//  ИсключаемыеУзлы          - Массив из ПланОбменаСсылка - список узлов для исключения.
//  ДополнительныеПараметры - Структура - См. ВыполнитьПереопределяемыеПравилаРегистрацииДляПланаОбменаПослеПРО.
//
Процедура ВыполнитьПравилоРегистрацийОбъектаДляУзлаПланаОбменаПослеПРО(ДанныеИБ, Узел, СтрокаПравила,
	УзлыПолучатели, ИсключаемыеУзлы, ДополнительныеПараметры)
	
	Если Не СтрокаПравила.ПрименитьСобственноеПравило Тогда
		Возврат;
	КонецЕсли;
	
	ФильтрПройден = Ложь;
	
	ПроверятьСсылку = ДополнительныеПараметры.ПроверятьСсылку;
	ЭтоРегистр      = ДополнительныеПараметры.ЭтоРегистр;
	
	// Для объекта ИБ
	ВыполнитьИсполняемыйКодПравилаРегистрации(ФильтрПройден, ДанныеИБ, СтрокаПравила,
		УзлыПолучатели, ИсключаемыеУзлы, ДополнительныеПараметры);
	
	// Для ссылки на данные ИБ, т.к. условие правила фильтрации могло измениться
	Если ПроверятьСсылку 
		И Не ФильтрПройден И Не ЭтоРегистр Тогда
		
		ВыполнитьИсполняемыйКодПравилаРегистрации(ФильтрПройден, ДанныеИБ.Ссылка, СтрокаПравила,
			УзлыПолучатели, ИсключаемыеУзлы, ДополнительныеПараметры);
		
	КонецЕсли;
	
	Если Не ФильтрПройден Тогда
		ИсключаемыеУзлы.Добавить(Узел);
	Иначе
		
		// Если объект не подобрался по типовым, но подобрался по исполняемым, то принудительно регистрируем
		Если УзлыПолучатели.Найти(Узел) = Неопределено Тогда
			УзлыПолучатели.Добавить(Узел);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьИсполняемыйКодПравилаРегистрации(ФильтрПройден, ДанныеИБ, СтрокаПравила,
	УзлыПолучатели, ИсключаемыеУзлы, ДополнительныеПараметры)
	
	Параметры = Новый Структура;
	Параметры.Вставить("ФильтрПройден",           ФильтрПройден);
	Параметры.Вставить("ДанныеИБ",                ДанныеИБ);
	Параметры.Вставить("УзлыПолучатели",          УзлыПолучатели);
	Параметры.Вставить("ИсключаемыеУзлы",         ИсключаемыеУзлы);
	Параметры.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	ИсполняемыйКод = 
	" ФильтрПройден = Параметры.ФильтрПройден;
	| ДанныеИБ = Параметры.ДанныеИБ;
	| УзлыПолучатели = Параметры.УзлыПолучатели;
	| ИсключаемыеУзлы = Параметры.ИсключаемыеУзлы;
	| ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	| &ИсполняемыйКод;
	| Параметры.ФильтрПройден = ФильтрПройден;
	| Параметры.УзлыПолучатели = УзлыПолучатели;
	| Параметры.ИсключаемыеУзлы = ИсключаемыеУзлы;";
	
	ИсполняемыйКод = СтрЗаменить(ИсполняемыйКод, "&ИсполняемыйКод", СтрокаПравила.ИсполняемыйКод);
	
	Попытка
		
		ОбщегоНазначения.ВыполнитьВБезопасномРежиме(ИсполняемыйКод, Параметры);
		
		ФильтрПройден   = Параметры.ФильтрПройден;
		УзлыПолучатели  = Параметры.УзлыПолучатели;
		ИсключаемыеУзлы = Параметры.ИсключаемыеУзлы;
		
	Исключение
		
		ШаблонТекста = НСтр("ru = 'Не удалось выполнить исполняемый код переопределяемого правила регистрации. 
		                          |Причина: %1'");
		
		ОписаниеОшибки = СтрШаблон(ШаблонТекста,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение ОписаниеОшибки;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Вспомогательные

// Возвращает правила обработки данных для указанного узла плана обмена
//
// Параметры:
//   УзелИнформационнойБазы - ОпределяемыйТип.ПРО_УзелПланаОбмена - Узел план обмена информационной базы
//
// Возвращаемое значение:
//   ТаблицаЗначений - Список правил обработки данных с указанием параметров их применения
//
Функция ПравилаОбработкиДанныхПоМенеджеруОбмена(УзелИнформационнойБазы)
	
	//@skip-check bsl-legacy-check-string-literal
	ВерсияФорматаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелИнформационнойБазы, "ВерсияФорматаОбмена");
	
	// Используется нелегальная, но стабильная от версии к версии точка интеграции.
	// При несовместимости с версией УТ выбросит понятное исключение.
	// Минимально совместимая версия: БСП 3.0.
	Попытка
		
		МенеджерОбмена = ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата(
			ВерсияФорматаОбмена,
			УзелИнформационнойБазы
		);
	Исключение
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'ПРО: не удалось получить менеджер обмена для узла [%1].
			           |Возможна несовместимость расширения с текущей версией УТ/БСП.
			           |Ошибка: %2'"),
			УзелИнформационнойБазы,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	// Инициализация таблицы правил обработки данных.
	ПравилаОбработкиДанных = Новый ТаблицаЗначений;
	ПравилаОбработкиДанных.Колонки.Добавить("Имя");
	ПравилаОбработкиДанных.Колонки.Добавить("ОбъектВыборкиФормат");
	ПравилаОбработкиДанных.Колонки.Добавить("ТипСсылкиXDTO");
	ПравилаОбработкиДанных.Колонки.Добавить("ОбъектВыборкиМетаданные");
	ПравилаОбработкиДанных.Колонки.Добавить("ВыборкаДанных");
	ПравилаОбработкиДанных.Колонки.Добавить("ИмяТаблицыДляВыборки");
	ПравилаОбработкиДанных.Колонки.Добавить("ПриОбработке", Новый ОписаниеТипов("Строка"));
	
	// ИспользуемыеПКО - массив, содержащий в себе имена ПКО, в которые может быть направлен объект из данного ПОД.
	ПравилаОбработкиДанных.Колонки.Добавить("ИспользуемыеПКО", Новый ОписаниеТипов("Массив"));
	
	МенеджерОбмена.ЗаполнитьПравилаОбработкиДанных("Отправка", ПравилаОбработкиДанных);
	
	Возврат ПравилаОбработкиДанных;
	
КонецФункции

#КонецОбласти

#КонецОбласти
